app/controllers/products_controller.rb

  def index
    @gem_stones = GemStone.all
    @metals = Metal.all
    @products = Product.all
---
SELECT "products".* FROM "products"